CSI API ETABS v1
cAnalysisResults.PanelZoneDeformation Method
 Reports the panel zone (link) internal deformations
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int PanelZoneDeformation(
	string Name,
	eItemTypeElm ItemTypeElm,
	ref int NumberResults,
	ref string[] Elm,
	ref string[] LoadCase,
	ref string[] StepType,
	ref double[] StepNum,
	ref double[] U1,
	ref double[] U2,
	ref double[] U3,
	ref double[] R1,
	ref double[] R2,
	ref double[] R3
)
Function PanelZoneDeformation (
	Name As String,
	ItemTypeElm As eItemTypeElm,
	ByRef NumberResults As Integer,
	ByRef Elm As String(),
	ByRef LoadCase As String(),
	ByRef StepType As String(),
	ByRef StepNum As Double(),
	ByRef U1 As Double(),
	ByRef U2 As Double(),
	ByRef U3 As Double(),
	ByRef R1 As Double(),
	ByRef R2 As Double(),
	ByRef R3 As Double()
) As Integer
Dim instance As cAnalysisResults
Dim Name As String
Dim ItemTypeElm As eItemTypeElm
Dim NumberResults As Integer
Dim Elm As String()
Dim LoadCase As String()
Dim StepType As String()
Dim StepNum As Double()
Dim U1 As Double()
Dim U2 As Double()
Dim U3 As Double()
Dim R1 As Double()
Dim R2 As Double()
Dim R3 As Double()
Dim returnValue As Integer
returnValue = instance.PanelZoneDeformation(Name,
	ItemTypeElm, NumberResults, Elm,
	LoadCase, StepType, StepNum, U1, U2,
	U3, R1, R2, R3)
int PanelZoneDeformation(
	String^ Name,
	eItemTypeElm ItemTypeElm,
	int% NumberResults,
	array<String^>^% Elm,
	array<String^>^% LoadCase,
	array<String^>^% StepType,
	array<double>^% StepNum,
	array<double>^% U1,
	array<double>^% U2,
	array<double>^% U3,
	array<double>^% R1,
	array<double>^% R2,
	array<double>^% R3
)
abstract PanelZoneDeformation :
        Name : string *
        ItemTypeElm : eItemTypeElm *
        NumberResults : int byref *
        Elm : string[] byref *
        LoadCase : string[] byref *
        StepType : string[] byref *
        StepNum : float[] byref *
        U1 : float[] byref *
        U2 : float[] byref *
        U3 : float[] byref *
        R1 : float[] byref *
        R2 : float[] byref *
        R3 : float[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing link object, link element, or group of objects depending on the value of the ItemTypeElm item.
ItemTypeElm
Type: ETABSv1.eItemTypeElm
 This is one of the following items in the eItemTypeElm enumeration.
 If this item is ObjectElm, the result request is for the panel zone (link) element corresponding to the panel zone assignment to the point object specified by the Name item.
 If this item is Element, the result request is for the panel zone (link) element specified by the Name item.
 If this item is GroupElm, the result request is for all panel zone (link) elements directly or indirectly specified in the group specified by the Name item.
 If this item is SelectionElm, the result request is for all panel zone (link) elements directly or indirectly selected and the Name item is ignored.
 For GroupElm and SelectionElm a panel zone (link) element may be indirectly specified through point objects that have panel zone assignments.
NumberResults
Type: System.Int32
 The total number of results returned by the program.
Elm
Type: System.String[]
 This is an array that includes the panel zone (link) element name associated with each result.
LoadCase
Type: System.String[]
 This is an array that includes the name of the analysis case or load combination associated with each result.
StepType
Type: System.String[]
 This is an array that includes the step type, if any, for each result.
StepNum
Type: System.Double[]
 This is an array that includes the step number, if any, for each result.
U1
Type: System.Double[]
 This is a one dimensional array that includes the internal translational deformation of the panel zone (link) in the link element local 1-axis direction. [L]
U2
Type: System.Double[]
 This is a one dimensional array that includes the internal translational deformation of the panel zone (link) in the link element local 2-axis direction. [L]
U3
Type: System.Double[]
 This is a one dimensional array that includes the internal translational deformation of the panel zone (link) in the link element local 3-axis direction. [L]
R1
Type: System.Double[]
 This is a one dimensional array that includes the internal rotational deformation of the panel zone (link) about the link element local 1-axis. [L]
R2
Type: System.Double[]
 This is a one dimensional array that includes the internal rotational deformation of the panel zone (link) about the link element local 2-axis. [L]
R3
Type: System.Double[]
 This is a one dimensional array that includes the internal rotational deformation of the panel zone (link) about the link element local 3-axis. [L]
Return Value
Type: Int32
 Returns zero if the deformations are successfully recovered, otherwise it returns a nonzero value
Remarks
 See Results for more information.
Examples
Public Sub Example()
   'dimension variables
   Dim SapObject as cOAPI
   Dim SapModel As cSapModel
   Dim ret As Integer = -1
   Dim NumberResults As Integer
   Dim Elm() As String
   Dim LoadCase() As String
   Dim StepType() As String
   Dim StepNum() As Double
   Dim U1() As Double
   Dim U2() As Double
   Dim U3() As Double
   Dim R1() As Double
   Dim R2() As Double
   Dim R3() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'assign panel zone to point object "3"
       ret = SapModel.PointObj.SetPanelZone("3", 1, 2, 0, 0, "", 0, 0, 0)
   'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis()
   'deselect all cases and combos
       ret = SapModel.Results.Setup.DeselectAllCasesAndCombosForOutput()
   'set case selected for output
       ret = SapModel.Results.Setup.SetCaseSelectedForOutput("MODAL")
   'get panel zone deformation for point object "3"
       ret = SapModel.Results.PanelZoneDeformation("3", eItemTypeElm.ObjectElm, NumberResults, Elm, LoadCase, StepType, StepNum, U1, U2, U3, R1, R2, R3)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalysisResults Interface
ETABSv1 Namespace